In [2]:
import pandas as pd
import numpy as np

C:\Users\HP\AppData\Local\Temp\ipykernel_22068\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
labels = ('vardas', 'pavardė', 'amžius')
zmogus = ('Geras', 'Zmogelis', 33)
print(labels, zmogus)

('vardas', 'pavardė', 'amžius') ('Geras', 'Zmogelis', 33)

In [4]:
pd.Series(data=zmogus)

0       Geras
1    Zmogelis
2          33
dtype: object

In [5]:
pd.Series(data=zmogus, index=labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [6]:
zmogus_dict = {
    'vardas': 'Smagus',
    'pavarde': 'Giedriukas',
    'amzius': 36
}
zmogus_dict

{'vardas': 'Smagus', 'pavarde': 'Giedriukas', 'amzius': 36}

In [7]:
zmogus_pd = pd.Series(zmogus_dict)
zmogus_pd

vardas         Smagus
pavarde    Giedriukas
amzius             36
dtype: object

In [8]:
pd.Series(zmogus, labels)

vardas        Geras
pavardė    Zmogelis
amžius           33
dtype: object

In [9]:
zmogus_pd['amzius']

36

In [10]:
miestai = pd.Series((500, 400, 300, 200), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
miestai

Vilnius     500
Kaunas      400
Klaipeda    300
Siauliai    200
dtype: int64

In [11]:
augimas = pd.Series((1.5, 1.3, 0.9, 0.7), ('Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai'))
augimas

Vilnius     1.5
Kaunas      1.3
Klaipeda    0.9
Siauliai    0.7
dtype: float64

In [12]:
miestai * augimas

Vilnius     750.0
Kaunas      520.0
Klaipeda    270.0
Siauliai    140.0
dtype: float64

In [13]:
betko7x7 = np.random.randint(10, 100, (7, 7))
betko7x7

array([[71, 14, 47, 31, 60, 85, 50],
       [51, 61, 51, 23, 22, 43, 14],
       [38, 77, 14, 42, 91, 74, 39],
       [86, 48, 82, 89, 15, 58, 40],
       [10, 17, 80, 41, 50, 94, 72],
       [46, 24, 75, 80, 49, 25, 70],
       [85, 52, 83, 67, 16, 27, 91]])

In [14]:
miestu_skaiciai = pd.DataFrame(
    betko7x7,
    [2000, 2004, 2008, 2012, 2016, 2020, 2024],
    ['Vilnius', 'Kaunas', 'Klaipeda', 'Siauliai', 'Panevezys', 'Alytus', 'Druskininkai']
)
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Siauliai  Panevezys  Alytus  Druskininkai
2000       71      14        47        31         60      85            50
2004       51      61        51        23         22      43            14
2008       38      77        14        42         91      74            39
2012       86      48        82        89         15      58            40
2016       10      17        80        41         50      94            72
2020       46      24        75        80         49      25            70
2024       85      52        83        67         16      27            91

In [15]:
miestu_skaiciai['Klaipeda']

2000    47
2004    51
2008    14
2012    82
2016    80
2020    75
2024    83
Name: Klaipeda, dtype: int32

In [16]:
print(type(miestu_skaiciai['Klaipeda']))
print(type(miestu_skaiciai))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [17]:
miestu_skaiciai[['Vilnius', 'Alytus', 'Druskininkai']]

      Vilnius  Alytus  Druskininkai
2000       71      85            50
2004       51      43            14
2008       38      74            39
2012       86      58            40
2016       10      94            72
2020       46      25            70
2024       85      27            91

In [18]:
miestu_skaiciai['Vilnius'][2000] = 99
miestu_skaiciai['Vilnius'][2000]

C:\Users\HP\AppData\Local\Temp\ipykernel_22068\2762690240.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  miestu_skaiciai['Vilnius'][2000] = 99

99

In [19]:
miestu_skaiciai.loc[2012]

Vilnius         86
Kaunas          48
Klaipeda        82
Siauliai        89
Panevezys       15
Alytus          58
Druskininkai    40
Name: 2012, dtype: int32

In [20]:
kazluruda = pd.Series(np.random.randint(10, 99, 7), np.arange(2000, 2025, 4))
kazluruda

2000    32
2004    10
2008    87
2012    26
2016    17
2020    49
2024    98
dtype: int32

In [21]:
miestu_skaiciai['Kazlu Ruda'] = kazluruda
miestu_skaiciai

,Vilnius,Kaunas,Klaipeda,Siauliai,Panevezys,Alytus,Druskininkai,Kazlu Ruda
2000,99,14,47,31,60,85,50,32
2004,51,61,51,23,22,43,14,10
2008,38,77,14,42,91,74,39,87
2012,86,48,82,89,15,58,40,26
2016,10,17,80,41,50,94,72,17
2020,46,24,75,80,49,25,70,49
2024,85,52,83,67,16,27,91,98

In [22]:
miestu_skaiciai.drop('Siauliai', axis=1, inplace=True)

In [23]:
miestu_skaiciai

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      14        47         60      85            50          32
2004       51      61        51         22      43            14          10
2008       38      77        14         91      74            39          87
2012       86      48        82         15      58            40          26
2016       10      17        80         50      94            72          17
2020       46      24        75         49      25            70          49
2024       85      52        83         16      27            91          98

In [24]:
miestai_be_2008 = miestu_skaiciai.drop(2008)
miestai_be_2008

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      14        47         60      85            50          32
2004       51      61        51         22      43            14          10
2012       86      48        82         15      58            40          26
2016       10      17        80         50      94            72          17
2020       46      24        75         49      25            70          49
2024       85      52        83         16      27            91          98

In [25]:
miestu_skaiciai.loc[2008]

Vilnius         38
Kaunas          77
Klaipeda        14
Panevezys       91
Alytus          74
Druskininkai    39
Kazlu Ruda      87
Name: 2008, dtype: int32

In [26]:
miestu_skaiciai.iloc[3]

Vilnius         86
Kaunas          48
Klaipeda        82
Panevezys       15
Alytus          58
Druskininkai    40
Kazlu Ruda      26
Name: 2012, dtype: int32

In [27]:
miestu_skaiciai['Vilnius'][2020]

46

In [28]:
miestu_skaiciai.loc[2020, 'Vilnius']

46

In [29]:
miestu_skaiciai.loc[[2012, 2020, 2024], ['Kaunas', 'Alytus']]

      Kaunas  Alytus
2012      48      58
2020      24      25
2024      52      27

In [30]:
miestu_skaiciai[['Kaunas', 'Alytus']].loc[[2020, 2012, 2000]]

      Kaunas  Alytus
2020      24      25
2012      48      58
2000      14      85

In [31]:
miestu_skaiciai[miestu_skaiciai > 70]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000     99.0     NaN       NaN        NaN    85.0           NaN         NaN
2004      NaN     NaN       NaN        NaN     NaN           NaN         NaN
2008      NaN    77.0       NaN       91.0    74.0           NaN        87.0
2012     86.0     NaN      82.0        NaN     NaN           NaN         NaN
2016      NaN     NaN      80.0        NaN    94.0          72.0         NaN
2020      NaN     NaN      75.0        NaN     NaN           NaN         NaN
2024     85.0     NaN      83.0        NaN     NaN          91.0        98.0

In [32]:
print(miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 50])

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2004       51      61        51         22      43            14          10
2012       86      48        82         15      58            40          26
2016       10      17        80         50      94            72          17
2020       46      24        75         49      25            70          49
2024       85      52        83         16      27            91          98

In [33]:
miestu_skaiciai[miestu_skaiciai['Klaipeda'] > 80][['Vilnius', 'Klaipeda']]

      Vilnius  Klaipeda
2012       86        82
2024       85        83

In [34]:
miestu_skaiciai[(miestu_skaiciai['Vilnius'] > 90) | (miestu_skaiciai['Klaipeda'] > 80)]

      Vilnius  Kaunas  Klaipeda  Panevezys  Alytus  Druskininkai  Kazlu Ruda
2000       99      14        47         60      85            50          32
2012       86      48        82         15      58            40          26
2024       85      52        83         16      27            91          98

In [35]:
miestu_skaiciai.reset_index()

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,14,47,60,85,50,32
1,2004,51,61,51,22,43,14,10
2,2008,38,77,14,91,74,39,87
3,2012,86,48,82,15,58,40,26
4,2016,10,17,80,50,94,72,17
5,2020,46,24,75,49,25,70,49
6,2024,85,52,83,16,27,91,98

In [36]:
be_indekso = miestu_skaiciai.reset_index()
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda
0,2000,99,14,47,60,85,50,32
1,2004,51,61,51,22,43,14,10
2,2008,38,77,14,91,74,39,87
3,2012,86,48,82,15,58,40,26
4,2016,10,17,80,50,94,72,17
5,2020,46,24,75,49,25,70,49
6,2024,85,52,83,16,27,91,98

In [37]:
be_indekso['Utena'] = np.random.randint(10, 71, 7)
be_indekso

,index,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
0,2000,99,14,47,60,85,50,32,42
1,2004,51,61,51,22,43,14,10,28
2,2008,38,77,14,91,74,39,87,38
3,2012,86,48,82,15,58,40,26,50
4,2016,10,17,80,50,94,72,17,20
5,2020,46,24,75,49,25,70,49,60
6,2024,85,52,83,16,27,91,98,62

In [38]:
su_utena = be_indekso.set_index('index')
su_utena

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99,14,47,60,85,50,32,42
2004,51,61,51,22,43,14,10,28
2008,38,77,14,91,74,39,87,38
2012,86,48,82,15,58,40,26,50
2016,10,17,80,50,94,72,17,20
2020,46,24,75,49,25,70,49,60
2024,85,52,83,16,27,91,98,62

In [39]:
su_utena[su_utena > 20]

,Vilnius,Kaunas,Klaipeda,Panevezys,Alytus,Druskininkai,Kazlu Ruda,Utena
index,,,,,,,,
2000,99.0,NaN,47.0,60.0,85,50.0,32.0,42.0
2004,51.0,61.0,51.0,22.0,43,NaN,NaN,28.0
2008,38.0,77.0,NaN,91.0,74,39.0,87.0,38.0
2012,86.0,48.0,82.0,NaN,58,40.0,26.0,50.0
2016,NaN,NaN,80.0,50.0,94,72.0,NaN,NaN
2020,46.0,24.0,75.0,49.0,25,70.0,49.0,60.0
2024,85.0,52.0,83.0,NaN,27,91.0,98.0,62.0